IDEA Open Model
CrossSectionFactory.FillColdFormedOmega Method
Compatible with IDEA StatiCa Beta 20.0
 Fill parameters for cold formed Omega section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillColdFormedOmega(
	CrossSectionParameter css,
	double Width,
	double Height,
	double FlangeWidth,
	double Thickness,
	double Radius
)
Public Shared Sub FillColdFormedOmega (
	css As CrossSectionParameter,
	Width As Double,
	Height As Double,
	FlangeWidth As Double,
	Thickness As Double,
	Radius As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width
Type: System.Double
Css width
Height
Type: System.Double
Height of cross-section
FlangeWidth
Type: System.Double
Flange width
Thickness
Type: System.Double
Thickness
Radius
Type: System.Double
Inside radius
Remarks
Dimension of cold formed Omega section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 8;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.20;
double Height = 0.10;
double FlangeWidth = 0.10;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedOmega(css, Width, Height, FlangeWidth, Thickness, Radius);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace